The  DirectShapeOptions  type exposes the following members.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  DirectShapeOptions
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ReferencingOption
 Whether or not the geometry stored in a DirectShape or DirectShapeType object may be referenced.
RoomBoundingOption
 Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.
 See Also
  DirectShapeOptions Class
  Autodesk.Revit.DB Namespace